In [2]:
import pandas as pd
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.753747  0.589447
1    a  two  1.119135 -0.800934
2    b  one -0.931917 -0.528332
3    b  two  1.226084  0.736386
4    a  one  1.275528  1.440353

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a    1.049470
b    0.147084
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one     1.014637
      two     1.119135
b     one    -0.931917
      two     1.226084
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a     1.014637  1.119135
b    -0.931917  1.226084

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005    1.119135
            2006   -0.931917
Ohio        2005    0.989915
            2006    1.275528
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a     1.049470  0.409622
b     0.147084  0.104027

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   1.014637  1.014900
     two   1.119135 -0.800934
b    one  -0.931917 -0.528332
     two   1.226084  0.736386

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [20]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.753747  0.589447
1    a  two  1.119135 -0.800934
4    a  one  1.275528  1.440353
b
  key1 key2     data1     data2
2    b  one -0.931917 -0.528332
3    b  two  1.226084  0.736386

In [24]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.753747  0.589447
4    a  one  1.275528  1.440353
('a', 'two')
  key1 key2     data1     data2
1    a  two  1.119135 -0.800934
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.931917 -0.528332
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.226084  0.736386

In [25]:
pieces = dict(list(df.groupby('key1')))

In [26]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.931917 -0.528332
3    b  two  1.226084  0.736386

In [27]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [28]:
grouped = df.groupby(df.dtypes, axis=1)

In [29]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.753747  0.589447
1  1.119135 -0.800934
2 -0.931917 -0.528332
3  1.226084  0.736386
4  1.275528  1.440353
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [30]:
df.groupby('key1')['data1']

In [31]:
df.groupby('key1')[['data2']]

In [32]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   1.014900
     two  -0.800934
b    one  -0.528332
     two   0.736386

In [33]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [34]:
s_grouped

In [35]:
s_grouped.mean()

key1  key2
a     one     1.014900
      two    -0.800934
b     one    -0.528332
      two     0.736386
Name: data2, dtype: float64

In [36]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [37]:
people.iloc[2:3, [1, 2]] = np.nan

In [38]:
people

               a         b         c         d         e
Joe    -0.173959 -0.465043 -0.822143 -0.700499  1.318665
Steve   0.038865 -0.857133  1.926415 -0.573614  0.320231
Wes     0.556979       NaN       NaN -1.651702 -0.904616
Jim    -0.331015 -0.367972  1.126304  0.872843 -0.603497
Travis  0.066505 -2.065665  1.070988  0.366529  0.120341

In [39]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [40]:
by_column = people.groupby(mapping, axis=1)

In [41]:
by_column.sum()

            blue       red
Joe    -1.522642  0.679663
Steve   1.352800 -0.498037
Wes    -1.651702 -0.347636
Jim     1.999147 -1.302484
Travis  1.437517 -1.878818

In [42]:
map_series = pd.Series(mapping)

In [43]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [44]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [45]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.052004 -0.833015  0.304161 -1.479358 -0.189448
5  0.038865 -0.857133  1.926415 -0.573614  0.320231
6  0.066505 -2.065665  1.070988  0.366529  0.120341

In [46]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [47]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.173959 -0.465043 -0.822143 -1.651702 -0.904616
  two -0.331015 -0.367972  1.126304  0.872843 -0.603497
5 one  0.038865 -0.857133  1.926415 -0.573614  0.320231
6 two  0.066505 -2.065665  1.070988  0.366529  0.120341

In [48]:
people.groupby(len)

In [50]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                     names=['cty', 'tenor'])

In [51]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [52]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.628565 -1.305199  0.317768  0.197555 -0.919357
1      0.681351  0.463498  1.043915 -1.742591 -0.262621
2      0.845601  1.178949  0.739046  1.328370 -0.820069
3      0.678659 -0.298530 -0.119680  0.566096 -0.426243

In [53]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [54]:
df

  key1 key2     data1     data2
0    a  one  0.753747  0.589447
1    a  two  1.119135 -0.800934
2    b  one -0.931917 -0.528332
3    b  two  1.226084  0.736386
4    a  one  1.275528  1.440353

In [55]:
grouped = df.groupby('key1')

In [58]:
grouped['data1'].quantile(0.9)

key1
a    1.244250
b    1.010284
Name: data1, dtype: float64

In [59]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [60]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.521781  2.241287
b     2.158000  1.264719

In [61]:
grouped.describe()

     data1                        ...        data2
     count      mean       std    ...          50%       75%       max
key1                              ...
a      3.0  1.049470  0.267776    ...     0.589447  1.014900  1.440353
b      2.0  0.147084  1.525937    ...     0.104027  0.420207  0.736386

[2 rows x 16 columns]

In [62]:
tips = pd.read_csv('examples-tips.csv')

In [63]:
tips['tip_pct'] = tips['tip']/tips['total_bill']

In [64]:
tips[:6]

   total_bill  tip  smoker day        time  size   tip_pct
0          16   99    1.01  No  Sun Dinner     2  6.187500
1          10   34    1.66  No  Sun Dinner     3  3.400000
2          21    1    3.50  No  Sun Dinner     3  0.047619
3          23   68    3.31  No  Sun Dinner     2  2.956522
4          24   59    3.61  No  Sun Dinner     4  2.458333
5          25   29    4.71  No  Sun Dinner     4  1.160000

In [72]:
grouped = tips.groupby(['day', 'smoker'])

In [75]:
grouped_pct = grouped['tip_pct']

In [76]:
grouped_pct.agg('mean')

day  smoker
No   1.01      6.187500
     1.66      3.400000
     3.31      2.956522
     3.50      0.047619
     3.61      2.458333
     4.71      1.160000
Name: tip_pct, dtype: float64

In [77]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                mean  std  peak_to_peak
day smoker
No  1.01    6.187500  NaN           0.0
    1.66    3.400000  NaN           0.0
    3.31    2.956522  NaN           0.0
    3.50    0.047619  NaN           0.0
    3.61    2.458333  NaN           0.0
    4.71    1.160000  NaN           0.0

In [78]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                 foo  bar
day smoker
No  1.01    6.187500  NaN
    1.66    3.400000  NaN
    3.31    2.956522  NaN
    3.50    0.047619  NaN
    3.61    2.458333  NaN
    4.71    1.160000  NaN

In [79]:
functions = ['count', 'mean', 'max']

In [80]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

In [81]:
result

           tip_pct                     total_bill
             count      mean       max      count mean max
day smoker
No  1.01         1  6.187500  6.187500          1   16  16
    1.66         1  3.400000  3.400000          1   10  10
    3.31         1  2.956522  2.956522          1   23  23
    3.50         1  0.047619  0.047619          1   21  21
    3.61         1  2.458333  2.458333          1   24  24
    4.71         1  1.160000  1.160000          1   25  25

In [82]:
result['tip_pct']

            count      mean       max
day smoker
No  1.01        1  6.187500  6.187500
    1.66        1  3.400000  3.400000
    3.31        1  2.956522  2.956522
    3.50        1  0.047619  0.047619
    3.61        1  2.458333  2.458333
    4.71        1  1.160000  1.160000

In [83]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [84]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                tip_pct              total_bill
           Durchschnitt Abweichung Durchschnitt Abweichung
day smoker
No  1.01       6.187500        NaN           16        NaN
    1.66       3.400000        NaN           10        NaN
    3.31       2.956522        NaN           23        NaN
    3.50       0.047619        NaN           21        NaN
    3.61       2.458333        NaN           24        NaN
    4.71       1.160000        NaN           25        NaN

In [85]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

  day  smoker  total_bill  tip  size   tip_pct
0  No    1.01          16   99     2  6.187500
1  No    1.66          10   34     3  3.400000
2  No    3.31          23   68     2  2.956522
3  No    3.50          21    1     3  0.047619
4  No    3.61          24   59     4  2.458333
5  No    4.71          25   29     4  1.160000

In [86]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [87]:
top(tips, n=6)

   total_bill  tip  smoker day        time  size   tip_pct
2          21    1    3.50  No  Sun Dinner     3  0.047619
5          25   29    4.71  No  Sun Dinner     4  1.160000
4          24   59    3.61  No  Sun Dinner     4  2.458333
3          23   68    3.31  No  Sun Dinner     2  2.956522
1          10   34    1.66  No  Sun Dinner     3  3.400000
0          16   99    1.01  No  Sun Dinner     2  6.187500

In [88]:
tips.groupby('smoker').apply(top)

          total_bill  tip  smoker day        time  size   tip_pct
smoker
1.01   0          16   99    1.01  No  Sun Dinner     2  6.187500
1.66   1          10   34    1.66  No  Sun Dinner     3  3.400000
3.31   3          23   68    3.31  No  Sun Dinner     2  2.956522
3.50   2          21    1    3.50  No  Sun Dinner     3  0.047619
3.61   4          24   59    3.61  No  Sun Dinner     4  2.458333
4.71   5          25   29    4.71  No  Sun Dinner     4  1.160000

In [89]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

              total_bill  tip  smoker day        time  size   tip_pct
smoker day
1.01   No  0          16   99    1.01  No  Sun Dinner     2  6.187500
1.66   No  1          10   34    1.66  No  Sun Dinner     3  3.400000
3.31   No  3          23   68    3.31  No  Sun Dinner     2  2.956522
3.50   No  2          21    1    3.50  No  Sun Dinner     3  0.047619
3.61   No  4          24   59    3.61  No  Sun Dinner     4  2.458333
4.71   No  5          25   29    4.71  No  Sun Dinner     4  1.160000

In [90]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [91]:
result

        count      mean  std    ...          50%       75%       max
smoker                          ...
1.01      1.0  6.187500  NaN    ...     6.187500  6.187500  6.187500
1.66      1.0  3.400000  NaN    ...     3.400000  3.400000  3.400000
3.31      1.0  2.956522  NaN    ...     2.956522  2.956522  2.956522
3.50      1.0  0.047619  NaN    ...     0.047619  0.047619  0.047619
3.61      1.0  2.458333  NaN    ...     2.458333  2.458333  2.458333
4.71      1.0  1.160000  NaN    ...     1.160000  1.160000  1.160000

[6 rows x 8 columns]

In [92]:
result.unstack('smoker')

       smoker
count  1.01      1.000000
       1.66      1.000000
       3.31      1.000000
       3.50      1.000000
       3.61      1.000000
       4.71      1.000000
mean   1.01      6.187500
       1.66      3.400000
       3.31      2.956522
       3.50      0.047619
       3.61      2.458333
       4.71      1.160000
std    1.01           NaN
       1.66           NaN
       3.31           NaN
       3.50           NaN
       3.61           NaN
       4.71           NaN
min    1.01      6.187500
       1.66      3.400000
       3.31      2.956522
       3.50      0.047619
       3.61      2.458333
       4.71      1.160000
25%    1.01      6.187500
       1.66      3.400000
       3.31      2.956522
       3.50      0.047619
       3.61      2.458333
       4.71      1.160000
50%    1.01      6.187500
       1.66      3.400000
       3.31      2.956522
       3.50      0.047619
       3.61      2.458333
       4.71      1.160000
75%    1.01      6.187500
       1.66      3.400000
       3.31      2.956522
       3.50      0.047619
       3.61      2.458333
       4.71      1.160000
max    1.01      6.187500
       1.66      3.400000
       3.31      2.956522
       3.50      0.047619
       3.61      2.458333
       4.71      1.160000
dtype: float64

In [93]:
tips.groupby('smoker', group_keys=False).apply(top)

   total_bill  tip  smoker day        time  size   tip_pct
0          16   99    1.01  No  Sun Dinner     2  6.187500
1          10   34    1.66  No  Sun Dinner     3  3.400000
3          23   68    3.31  No  Sun Dinner     2  2.956522
2          21    1    3.50  No  Sun Dinner     3  0.047619
4          24   59    3.61  No  Sun Dinner     4  2.458333
5          25   29    4.71  No  Sun Dinner     4  1.160000

In [96]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [98]:
quartiles = pd.cut(frame.data1,4)

In [99]:
quartiles[:10]

0     (-0.606, 1.189]
1    (-2.402, -0.606]
2      (1.189, 2.985]
3    (-2.402, -0.606]
4    (-2.402, -0.606]
5    (-2.402, -0.606]
6     (-0.606, 1.189]
7      (1.189, 2.985]
8     (-0.606, 1.189]
9     (-0.606, 1.189]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-4.205, -2.402] < (-2.402, -0.606] < (-0.606, 1.189] < (1.189, 2.985]]

In [100]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [101]:
grouped = frame.data2.groupby(quartiles)

In [102]:
grouped

In [103]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-4.205, -2.402]    8.0  1.375428  0.143347 -0.834297
(-2.402, -0.606]  277.0  3.634444 -0.020494 -2.816123
(-0.606, 1.189]   591.0  3.182693 -0.061180 -3.121816
(1.189, 2.985]    124.0  2.104350 -0.158893 -3.176422

In [104]:
s = pd.Series(np.random.randn(6))

In [105]:
s[::2] = np.nan

In [106]:
s

0         NaN
1    0.710080
2         NaN
3   -0.223037
4         NaN
5    0.853559
dtype: float64

In [107]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [108]:
group_key = ['East'] * 4 + ['West'] * 4

In [109]:
data = pd.Series(np.random.randn(8), index=states)

In [110]:
data

Ohio         -0.144909
New York      0.101468
Vermont      -0.205060
Florida      -0.147220
Oregon        1.320783
Nevada       -0.816220
California    1.204471
Idaho        -0.197173
dtype: float64

In [111]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [112]:
data

Ohio         -0.144909
New York      0.101468
Vermont            NaN
Florida      -0.147220
Oregon        1.320783
Nevada             NaN
California    1.204471
Idaho              NaN
dtype: float64

In [113]:
data.groupby(group_key).mean()

East   -0.063554
West    1.262627
dtype: float64

In [114]:
fill_mean = lambda g: g.fillna(g.mean())

In [120]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.144909
New York      0.101468
Vermont      -0.063554
Florida      -0.147220
Oregon        1.320783
Nevada        1.262627
California    1.204471
Idaho         1.262627
dtype: float64

In [121]:
fill_values = {'East': 0.5, 'West': -1}

In [122]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [123]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.144909
New York      0.101468
Vermont       0.500000
Florida      -0.147220
Oregon        1.320783
Nevada       -1.000000
California    1.204471
Idaho        -1.000000
dtype: float64

In [139]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []

In [140]:
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

In [141]:
deck = pd.Series(card_val, index=cards)
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [142]:
def draw(deck, n=5):
    return deck.sample(n)

In [143]:
draw(deck)

5H      5
10S    10
9S      9
5D      5
10H    10
dtype: int64

In [144]:
get_suit = lambda card: card[-1]

In [145]:
deck.groupby(get_suit).apply(draw, n=2)

C  9C      9
   8C      8
D  2D      2
   AD      1
H  JH     10
   10H    10
S  9S      9
   8S      8
dtype: int64

In [146]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [147]:
df

  category      data   weights
0        a -1.324363  0.409906
1        a  1.077356  0.011600
2        a  0.863713  0.613801
3        a  1.038132  0.460072
4        b -1.891635  0.223173
5        b  0.827735  0.145856
6        b  0.485720  0.537479
7        b  2.332352  0.970969

In [148]:
grouped = df.groupby('category')

In [149]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [150]:
grouped.apply(get_wavg)

category
a    0.319247
b    1.184715
dtype: float64

In [152]:
tips.pivot_table(index=['day', 'smoker'])

            size  tip   tip_pct  total_bill
day smoker
No  1.01       2   99  6.187500          16
    1.66       3   34  3.400000          10
    3.31       2   68  2.956522          23
    3.50       3    1  0.047619          21
    3.61       4   59  2.458333          24
    4.71       4   29  1.160000          25

In [153]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')

               size                 ...    tip_pct
smoker         1.01 1.66 3.31 3.50  ...       3.31      3.50      3.61  4.71
time       day                      ...
Sun Dinner No     2    3    2    3  ...   2.956522  0.047619  2.458333  1.16

[1 rows x 12 columns]

In [154]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)

               size                  ...      tip_pct
smoker         1.01 1.66 3.31 3.5    ...          3.5      3.61  4.71       All
time       day                       ...
Sun Dinner No     2    3    2   3    ...     0.047619  2.458333  1.16  2.701662
All               2    3    2   3    ...     0.047619  2.458333  1.16  2.701662

[2 rows x 14 columns]

In [155]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

day                 No  All
time       smoker
Sun Dinner 1.01    1.0  1.0
           1.66    1.0  1.0
           3.31    1.0  1.0
           3.5     1.0  1.0
           3.61    1.0  1.0
           4.71    1.0  1.0
All                6.0  6.0

In [156]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

day                           No
time       size smoker
Sun Dinner 2    1.01    6.187500
                3.31    2.956522
           3    1.66    3.400000
                3.50    0.047619
           4    3.61    2.458333
                4.71    1.160000

In [157]:
data

Ohio         -0.144909
New York      0.101468
Vermont            NaN
Florida      -0.147220
Oregon        1.320783
Nevada             NaN
California    1.204471
Idaho              NaN
dtype: float64